Revit 2027 API
BuiltInFailures.StairRampFailures.CannotGenerateRamp Property
 Couldn't generate surfaces for ramp.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotGenerateRamp { get; }
Public Shared ReadOnly Property CannotGenerateRamp As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotGenerateRamp {
	FailureDefinitionId^ get ();
}
static member CannotGenerateRamp : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace